# LeaderLine Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..LeaderLine Property
ParameterTypeId Class See Also
---
"Leader Line"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId LeaderLine { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property LeaderLine As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ LeaderLine {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace